In [129]:
import pandas as pd

In [130]:
import numpy as np

In [131]:
df=pd.read_csv("C://Users//tusha//OneDrive//Desktop//AAA dsbdsa//A3//income_dataset.csv")

In [132]:
df

    Age  Income            Occupation  YearsExperience
0    22   82573               Teacher                9
1    29   25161  Marketing Assistant                 9
2    35   36461                    HR                7
3    34   75260                Doctor                4
4    25   72361              Engineer               10
5    30   86277     Software Engineer               10
6    26   46309              Engineer                8
7    23   19132     Software Engineer                5
8    24   67809              Engineer                1
9    24   82286  Marketing Assistant                 7
10   35   80211          Data Analyst                7
11   27   13873                Lawyer                1
12   31   36314                Doctor                3
13   24   68641               Teacher                6
14   25   50876                Lawyer                4
15   26   37351  Marketing Assistant                 2
16   28   81656              Engineer                2
17   32   83103               Teacher                7
18   30   57821                Doctor                4
19   31   49583               Teacher                3
20   33   85915              Engineer                2
21   34   58930              Engineer                2
22   24   54323          Data Analyst                1
23   30   40579     Software Engineer                6
24   35   19177                    HR                8
25   28   76636          Data Analyst                8
26   31   74714               Teacher                2
27   23   78153              Engineer                6
28   33   77046                    HR                9

In [133]:
df.head()

   Age  Income            Occupation  YearsExperience
0   22   82573               Teacher                9
1   29   25161  Marketing Assistant                 9
2   35   36461                    HR                7
3   34   75260                Doctor                4
4   25   72361              Engineer               10

In [134]:
df.tail()

    Age  Income    Occupation  YearsExperience
24   35   19177            HR                8
25   28   76636  Data Analyst                8
26   31   74714       Teacher                2
27   23   78153      Engineer                6
28   33   77046            HR                9

In [135]:
df.describe(include="all")

              Age        Income Occupation  YearsExperience
count   29.000000     29.000000         29        29.000000
unique        NaN           NaN          8              NaN
top           NaN           NaN   Engineer              NaN
freq          NaN           NaN          7              NaN
mean    28.689655  59259.689655        NaN         5.275862
std      4.175639  22755.703602        NaN         2.962824
min     22.000000  13873.000000        NaN         1.000000
25%     25.000000  40579.000000        NaN         2.000000
50%     29.000000  67809.000000        NaN         6.000000
75%     32.000000  78153.000000        NaN         8.000000
max     35.000000  86277.000000        NaN        10.000000

In [136]:
df.shape

(29, 4)

In [137]:
df[0:3]

   Age  Income            Occupation  YearsExperience
0   22   82573               Teacher                9
1   29   25161  Marketing Assistant                 9
2   35   36461                    HR                7

In [138]:
 df.loc[0:2]

   Age  Income            Occupation  YearsExperience
0   22   82573               Teacher                9
1   29   25161  Marketing Assistant                 9
2   35   36461                    HR                7

In [139]:
 df.iloc[1:3]

   Age  Income            Occupation  YearsExperience
1   29   25161  Marketing Assistant                 9
2   35   36461                    HR                7

In [140]:
 df.iloc[2:6,2:6]

          Occupation  YearsExperience
2                 HR                7
3             Doctor                4
4           Engineer               10
5  Software Engineer               10

In [141]:
df.isnull()

      Age  Income  Occupation  YearsExperience
0   False   False       False            False
1   False   False       False            False
2   False   False       False            False
3   False   False       False            False
4   False   False       False            False
5   False   False       False            False
6   False   False       False            False
7   False   False       False            False
8   False   False       False            False
9   False   False       False            False
10  False   False       False            False
11  False   False       False            False
12  False   False       False            False
13  False   False       False            False
14  False   False       False            False
15  False   False       False            False
16  False   False       False            False
17  False   False       False            False
18  False   False       False            False
19  False   False       False            False
20  False   False       False            False
21  False   False       False            False
22  False   False       False            False
23  False   False       False            False
24  False   False       False            False
25  False   False       False            False
26  False   False       False            False
27  False   False       False            False
28  False   False       False            False

In [142]:
df.isna()

      Age  Income  Occupation  YearsExperience
0   False   False       False            False
1   False   False       False            False
2   False   False       False            False
3   False   False       False            False
4   False   False       False            False
5   False   False       False            False
6   False   False       False            False
7   False   False       False            False
8   False   False       False            False
9   False   False       False            False
10  False   False       False            False
11  False   False       False            False
12  False   False       False            False
13  False   False       False            False
14  False   False       False            False
15  False   False       False            False
16  False   False       False            False
17  False   False       False            False
18  False   False       False            False
19  False   False       False            False
20  False   False       False            False
21  False   False       False            False
22  False   False       False            False
23  False   False       False            False
24  False   False       False            False
25  False   False       False            False
26  False   False       False            False
27  False   False       False            False
28  False   False       False            False

In [143]:
df.isnull().any()

Age                False
Income             False
Occupation         False
YearsExperience    False
dtype: bool

In [144]:
df.isnull().sum()

Age                0
Income             0
Occupation         0
YearsExperience    0
dtype: int64

In [145]:
df.dtypes

Age                 int64
Income              int64
Occupation         object
YearsExperience     int64
dtype: object

In [146]:
df.columns

Index(['Age', 'Income', 'Occupation', 'YearsExperience'], dtype='object')

In [147]:
print(df.Age.describe())
print(df.Income.describe())

count    29.000000
mean     28.689655
std       4.175639
min      22.000000
25%      25.000000
50%      29.000000
75%      32.000000
max      35.000000
Name: Age, dtype: float64
count       29.000000
mean     59259.689655
std      22755.703602
min      13873.000000
25%      40579.000000
50%      67809.000000
75%      78153.000000
max      86277.000000
Name: Income, dtype: float64

In [148]:
print(df.Age.mean())
print(df.Income.mean())

28.689655172413794
59259.68965517241

In [149]:
print(df.Age.median())
print(df.Income.median())

29.0
67809.0

In [150]:
df.std()

C:\Users\tusha\AppData\Local\Temp/ipykernel_4388/3390915376.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.std()

Age                    4.175639
Income             22755.703602
YearsExperience        2.962824
dtype: float64

In [151]:
print(df.Age.std())
print(df.Income.std())

4.175638944057903
22755.703602305086

In [152]:
df.min()

Age                          22
Income                    13873
Occupation         Data Analyst
YearsExperience               1
dtype: object

In [153]:
print(df.Age.min())
print(df.Income.min())

22
13873

In [154]:
df.max()

Age                     35
Income               86277
Occupation         Teacher
YearsExperience         10
dtype: object

In [155]:
print(df.Age.max())
print(df.Income.max())

35
86277

In [156]:
print(df.Age.max()-df.Age.min())
print(df.Income.max()-df.Income.min())

13
72404

In [157]:
df.var()

C:\Users\tusha\AppData\Local\Temp/ipykernel_4388/3059890634.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.var()

Age                1.743596e+01
Income             5.178220e+08
YearsExperience    8.778325e+00
dtype: float64

In [158]:
df.var(axis=1)

C:\Users\tusha\AppData\Local\Temp/ipykernel_4388/1739125924.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.var(axis=1)

0     2.271914e+09
1     2.107068e+08
2     4.426247e+08
3     1.887070e+09
4     1.744527e+09
5     2.480090e+09
6     7.143165e+08
7     1.218327e+08
8     1.532122e+09
9     2.256145e+09
10    2.143479e+09
11    6.402413e+07
12    4.391576e+08
13    1.569843e+09
14    8.622975e+08
15    4.646840e+08
16    2.221751e+09
17    2.300956e+09
18    1.113768e+09
19    8.189296e+08
20    2.459460e+09
21    1.156875e+09
22    9.832103e+08
23    5.483984e+08
24    1.223112e+08
25    1.956773e+09
26    1.859906e+09
27    2.035208e+09
28    1.977617e+09
dtype: float64

In [159]:
print(df.Age.var())
print(df.Income.var())

17.435960591133004
517822046.43596065

In [160]:
print(df.Age.mode())
print(df.Income.mode())

0    24
dtype: int64
0     13873
1     19132
2     19177
3     25161
4     36314
5     36461
6     37351
7     40579
8     46309
9     49583
10    50876
11    54323
12    57821
13    58930
14    67809
15    68641
16    72361
17    74714
18    75260
19    76636
20    77046
21    78153
22    80211
23    81656
24    82286
25    82573
26    83103
27    85915
28    86277
dtype: int64

In [161]:
print(df.Age.mode())

0    24
dtype: int64

In [162]:
df.describe(include="all")

              Age        Income Occupation  YearsExperience
count   29.000000     29.000000         29        29.000000
unique        NaN           NaN          8              NaN
top           NaN           NaN   Engineer              NaN
freq          NaN           NaN          7              NaN
mean    28.689655  59259.689655        NaN         5.275862
std      4.175639  22755.703602        NaN         2.962824
min     22.000000  13873.000000        NaN         1.000000
25%     25.000000  40579.000000        NaN         2.000000
50%     29.000000  67809.000000        NaN         6.000000
75%     32.000000  78153.000000        NaN         8.000000
max     35.000000  86277.000000        NaN        10.000000

In [163]:
summary_stats = df.groupby('Age')['Income'].describe()

In [164]:
summary_stats

,count,mean,std,min,25%,50%,75%,max
Age,,,,,,,,
22,1.0,82573.00,NaN,82573.0,82573.00,82573.0,82573.00,82573.0
23,2.0,48642.50,41734.149332,19132.0,33887.25,48642.5,63397.75,78153.0
24,4.0,68264.75,11420.991153,54323.0,64437.50,68225.0,72052.25,82286.0
25,2.0,61618.50,15192.189194,50876.0,56247.25,61618.5,66989.75,72361.0
26,2.0,41830.00,6334.262546,37351.0,39590.50,41830.0,44069.50,46309.0
27,1.0,13873.00,NaN,13873.0,13873.00,13873.0,13873.00,13873.0
28,2.0,79146.00,3549.676042,76636.0,77891.00,79146.0,80401.00,81656.0
29,1.0,25161.00,NaN,25161.0,25161.00,25161.0,25161.00,25161.0
30,3.0,61559.00,23077.181024,40579.0,49200.00,57821.0,72049.00,86277.0
31,3.0,53537.00,19502.963544,36314.0,42948.50,49583.0,62148.50,74714.0
32,1.0,83103.00,NaN,83103.0,83103.00,83103.0,83103.00,83103.0
33,2.0,81480.50,6271.330042,77046.0,79263.25,81480.5,83697.75,85915.0
34,2.0,67095.00,11547.053737,58930.0,63012.50,67095.0,71177.50,75260.0
35,3.0,45283.00,31458.831065,19177.0,27819.00,36461.0,58336.00,80211.0

In [165]:
iris=pd.read_csv("C://Users//tusha//OneDrive//Desktop//AAA dsbdsa//A3//iris.csv")

In [166]:
iris

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
4,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [167]:
 iris.describe(include="all")

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
count,150.000000,150.000000,150.000000,150.000000,150.000000,150
unique,NaN,NaN,NaN,NaN,NaN,3
top,NaN,NaN,NaN,NaN,NaN,Iris-setosa
freq,NaN,NaN,NaN,NaN,NaN,50
mean,75.500000,5.843333,3.054000,3.758667,1.198667,NaN
std,43.445368,0.828066,0.433594,1.764420,0.763161,NaN
min,1.000000,4.300000,2.000000,1.000000,0.100000,NaN
25%,38.250000,5.100000,2.800000,1.600000,0.300000,NaN
50%,75.500000,5.800000,3.000000,4.350000,1.300000,NaN
75%,112.750000,6.400000,3.300000,5.100000,1.800000,NaN
max,150.000000,7.900000,4.400000,6.900000,2.500000,NaN

In [168]:
 iris.shape

(150, 6)

In [169]:
 iris.isnull()

        Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm  Species
0    False          False         False          False         False    False
1    False          False         False          False         False    False
2    False          False         False          False         False    False
3    False          False         False          False         False    False
4    False          False         False          False         False    False
..     ...            ...           ...            ...           ...      ...
145  False          False         False          False         False    False
146  False          False         False          False         False    False
147  False          False         False          False         False    False
148  False          False         False          False         False    False
149  False          False         False          False         False    False

[150 rows x 6 columns]

In [170]:
iris.isna()

        Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm  Species
0    False          False         False          False         False    False
1    False          False         False          False         False    False
2    False          False         False          False         False    False
3    False          False         False          False         False    False
4    False          False         False          False         False    False
..     ...            ...           ...            ...           ...      ...
145  False          False         False          False         False    False
146  False          False         False          False         False    False
147  False          False         False          False         False    False
148  False          False         False          False         False    False
149  False          False         False          False         False    False

[150 rows x 6 columns]

In [171]:
iris.isnull().any()

Id               False
SepalLengthCm    False
SepalWidthCm     False
PetalLengthCm    False
PetalWidthCm     False
Species          False
dtype: bool

In [172]:
iris.isnull().sum()

Id               0
SepalLengthCm    0
SepalWidthCm     0
PetalLengthCm    0
PetalWidthCm     0
Species          0
dtype: int64

In [173]:
iris.SepalLengthCm.isnull().sum()

0

In [174]:
 iris.dtypes

Id                 int64
SepalLengthCm    float64
SepalWidthCm     float64
PetalLengthCm    float64
PetalWidthCm     float64
Species           object
dtype: object

In [175]:
iris.columns

Index(['Id', 'SepalLengthCm', 'SepalWidthCm', 'PetalLengthCm', 'PetalWidthCm',
       'Species'],
      dtype='object')

In [176]:
col_names =['Sepal_Length','Sepal_Width','Petal_Length','Petal_Width','Species']

In [177]:
irisSet = (iris['Species']== 'Iris-setosa')

In [178]:
print('Iris-setosa')
print(iris[irisSet].describe())

Iris-setosa
             Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count  50.00000       50.00000     50.000000      50.000000      50.00000
mean   25.50000        5.00600      3.418000       1.464000       0.24400
std    14.57738        0.35249      0.381024       0.173511       0.10721
min     1.00000        4.30000      2.300000       1.000000       0.10000
25%    13.25000        4.80000      3.125000       1.400000       0.20000
50%    25.50000        5.00000      3.400000       1.500000       0.20000
75%    37.75000        5.20000      3.675000       1.575000       0.30000
max    50.00000        5.80000      4.400000       1.900000       0.60000

In [179]:
irisVer = (iris['Species']== 'Iris-versicolor')

In [180]:
print('Iris-versicolor')
print(iris[irisVer].describe())

Iris-versicolor
              Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count   50.00000      50.000000     50.000000      50.000000     50.000000
mean    75.50000       5.936000      2.770000       4.260000      1.326000
std     14.57738       0.516171      0.313798       0.469911      0.197753
min     51.00000       4.900000      2.000000       3.000000      1.000000
25%     63.25000       5.600000      2.525000       4.000000      1.200000
50%     75.50000       5.900000      2.800000       4.350000      1.300000
75%     87.75000       6.300000      3.000000       4.600000      1.500000
max    100.00000       7.000000      3.400000       5.100000      1.800000

In [181]:
irisVir = (iris['Species']== 'Iris-virginica')

In [182]:
print('Iris-virginica')
print(iris[irisVir].describe())

Iris-virginica
              Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count   50.00000       50.00000     50.000000      50.000000      50.00000
mean   125.50000        6.58800      2.974000       5.552000       2.02600
std     14.57738        0.63588      0.322497       0.551895       0.27465
min    101.00000        4.90000      2.200000       4.500000       1.40000
25%    113.25000        6.22500      2.800000       5.100000       1.80000
50%    125.50000        6.50000      3.000000       5.550000       2.00000
75%    137.75000        6.90000      3.175000       5.875000       2.30000
max    150.00000        7.90000      3.800000       6.900000       2.50000

In [183]:
print(iris.SepalLengthCm.describe())
print(iris.SepalWidthCm.describe())
print(iris.PetalLengthCm.describe())
print(iris.PetalWidthCm.describe())

count    150.000000
mean       5.843333
std        0.828066
min        4.300000
25%        5.100000
50%        5.800000
75%        6.400000
max        7.900000
Name: SepalLengthCm, dtype: float64
count    150.000000
mean       3.054000
std        0.433594
min        2.000000
25%        2.800000
50%        3.000000
75%        3.300000
max        4.400000
Name: SepalWidthCm, dtype: float64
count    150.000000
mean       3.758667
std        1.764420
min        1.000000
25%        1.600000
50%        4.350000
75%        5.100000
max        6.900000
Name: PetalLengthCm, dtype: float64
count    150.000000
mean       1.198667
std        0.763161
min        0.100000
25%        0.300000
50%        1.300000
75%        1.800000
max        2.500000
Name: PetalWidthCm, dtype: float64

In [184]:
print(iris.SepalLengthCm.mean())
print(iris.SepalWidthCm.mean())
print(iris.PetalLengthCm.mean())
print(iris.PetalWidthCm.mean())

5.843333333333335
3.0540000000000007
3.7586666666666693
1.1986666666666672

In [185]:
 print(iris.SepalLengthCm.median())
print(iris.SepalWidthCm.median())
print(iris.PetalLengthCm.median())
print(iris.PetalWidthCm.median())

5.8
3.0
4.35
1.3

In [207]:
iris_numeric = iris.select_dtypes(include=['number'])
iris_std = iris_numeric.std()

In [209]:
iris_std

Id               43.445368
SepalLengthCm     0.828066
SepalWidthCm      0.433594
PetalLengthCm     1.764420
PetalWidthCm      0.763161
dtype: float64

In [187]:
print(iris.SepalLengthCm.std())
print(iris.SepalWidthCm.std())
print(iris.PetalLengthCm.std())
print(iris.PetalWidthCm.std())

0.8280661279778629
0.4335943113621737
1.7644204199522617
0.7631607417008414

In [188]:
iris.min()

Id                         1
SepalLengthCm            4.3
SepalWidthCm             2.0
PetalLengthCm            1.0
PetalWidthCm             0.1
Species          Iris-setosa
dtype: object

In [189]:
print(iris.SepalLengthCm.min())
print(iris.SepalWidthCm.min())
print(iris.PetalLengthCm.min())
print(iris.PetalWidthCm.min())

4.3
2.0
1.0
0.1

In [190]:
iris.max()

Id                          150
SepalLengthCm               7.9
SepalWidthCm                4.4
PetalLengthCm               6.9
PetalWidthCm                2.5
Species          Iris-virginica
dtype: object

In [191]:
 print(iris.SepalLengthCm.max())
print(iris.SepalWidthCm.max())
print(iris.PetalLengthCm.max())
print(iris.PetalWidthCm.max())

7.9
4.4
6.9
2.5

In [192]:
 print(iris.SepalLengthCm.max()-iris.SepalLengthCm.min())
print(iris.SepalWidthCm.max()-iris.SepalWidthCm.min())
print(iris.PetalLengthCm.max()-iris.PetalLengthCm.min())

3.6000000000000005
2.4000000000000004
5.9

In [193]:
print(iris.PetalWidthCm.max()-iris.PetalWidthCm.min())

2.4

In [194]:
iris.var()

C:\Users\tusha\AppData\Local\Temp/ipykernel_4388/1684580194.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  iris.var()

Id               1887.500000
SepalLengthCm       0.685694
SepalWidthCm        0.188004
PetalLengthCm       3.113179
PetalWidthCm        0.582414
dtype: float64

In [195]:
 iris.var(axis=1)

C:\Users\tusha\AppData\Local\Temp/ipykernel_4388/3986049926.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  iris.var(axis=1)

0         4.043
1         3.140
2         3.077
3         3.287
4         4.688
         ...
145    4018.843
146    4097.323
147    4140.268
148    4188.578
149    4268.783
Length: 150, dtype: float64

In [196]:
 print(iris.SepalLengthCm.var())
print(iris.SepalWidthCm.var())
print(iris.PetalLengthCm.var())
print(iris.PetalWidthCm.var())

0.6856935123042505
0.18800402684563763
3.1131794183445156
0.5824143176733784

In [197]:
print(iris.SepalLengthCm.quantile(0.25))
print(iris.SepalWidthCm.quantile(0.25))
print(iris.PetalLengthCm.quantile(0.25))
print(iris.PetalWidthCm.quantile(0.25))

5.1
2.8
1.6
0.3

In [198]:
 print(iris.SepalLengthCm.quantile(0.50))
print(iris.SepalWidthCm.quantile(0.50))
print(iris.PetalLengthCm.quantile(0.50))
print(iris.PetalWidthCm.quantile(0.50))

5.8
3.0
4.35
1.3

In [199]:
 print(iris.SepalLengthCm.quantile(0.75))
print(iris.SepalWidthCm.quantile(0.75))
print(iris.PetalLengthCm.quantile(0.75))
print(iris.PetalWidthCm.quantile(0.75))

6.4
3.3
5.1
1.8

In [200]:
 print(iris.SepalLengthCm.skew())
print(iris.SepalWidthCm.skew())
print(iris.PetalLengthCm.skew())
print(iris.PetalWidthCm.skew())

0.3149109566369728
0.3340526621720866
-0.27446425247378287
-0.10499656214412734

In [202]:
 print((3*(iris.SepalLengthCm.mean()-iris.SepalLengthCm.median()))/(iris.
SepalLengthCm.std()))

0.1569922927743274

In [203]:
print(iris.Species.mode())

0        Iris-setosa
1    Iris-versicolor
2     Iris-virginica
dtype: object

In [204]:
print(iris.SepalLengthCm.mode())

0    5.0
dtype: float64